<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Office 2016 MIN_OS_VER 10.10.0 - Office 2019 MIN_OS_VER 10.13.6</string>
	<key>Description</key>
	<string>Downloads the latest version of Microsoft Office Suite and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.peetinc.munki.MicrosoftOffice</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Microsoft/%NAME%</string>
		<key>NAME</key>
		<string>MicrosoftOffice%YEAR%</string>
		<key>CATEGORY</key>
		<string>Productivity</string>
		<key>MIN_OS_VER</key>
		<string>10.10.0</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Microsoft Error Reporting.app</string>
				<string>Microsoft AutoUpdate.app</string>
				<string>Microsoft Excel.app</string>
				<string>Microsoft OneNote.app</string>
				<string>Microsoft Outlook.app</string>
				<string>Microsoft PowerPoint.app</string>
				<string>Microsoft Word.app</string>
				<string>OneDrive.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Unmistakably Office, designed for Mac.</string>
			<key>developer</key>
			<string>Microsoft</string>
			<key>display_name</key>
			<string>Microsoft Office %YEAR%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>category</key>
			<string>%CATEGORY%</string>
			<key>minimum_os_version</key>
			<string>%MIN_OS_VER%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.peetinc.download.MicrosoftOffice</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiInfoCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%pathname%</string>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/downloads/MicrosoftOffice%YEAR%Installer.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FileMover</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/MicrosoftOffice%YEAR%Installer.pkg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
