<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Office 2019 MIN_OS_VER 10.13.6</string>
	<key>Description</key>
	<string>Downloads the latest version of Microsoft Office Suite and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.peetinc.munki.MicrosoftOffice</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Microsoft/%NAME%</string>
		<key>NAME</key>
		<string>MicrosoftOffice%YEAR%</string>
		<key>CATEGORY</key>
		<string>Productivity</string>
		<key>MIN_OS_VER</key>
		<string>10.13.0</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Microsoft Error Reporting.app</string>
				<string>Microsoft AutoUpdate.app</string>
				<string>Microsoft Excel.app</string>
				<string>Microsoft OneNote.app</string>
				<string>Microsoft Outlook.app</string>
				<string>Microsoft PowerPoint.app</string>
				<string>Microsoft Word.app</string>
				<string>OneDrive.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Unmistakably Office, designed for Mac.</string>
			<key>developer</key>
			<string>Microsoft</string>
			<key>display_name</key>
			<string>Microsoft Office %YEAR%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>category</key>
			<string>%CATEGORY%</string>
			<key>minimum_os_version</key>
			<string>%MIN_OS_VER%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.peetinc.download.MicrosoftOffice2019</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkginfo</key>
				<dict>
					<key>installs</key>
					<array>
						<dict>
							<key>CFBundleIdentifier</key>
							<string>com.microsoft.Excel</string>
							<key>CFBundleName</key>
							<string>Excel</string>
							<key>CFBundleShortVersionString</key>
							<string>15.99</string>
							<key>CFBundleVersion</key>
							<string>15.99</string>
							<key>minosversion</key>
							<string>10.13</string>
							<key>path</key>
							<string>/Applications/Microsoft Excel.app</string>
							<key>type</key>
							<string>application</string>
							<key>version_comparison_key</key>
							<string>CFBundleShortVersionString</string>
						</dict>
						<dict>
							<key>CFBundleIdentifier</key>
							<string>com.microsoft.Outlook</string>
							<key>CFBundleName</key>
							<string>Outlook</string>
							<key>CFBundleShortVersionString</key>
							<string>15.99</string>
							<key>CFBundleVersion</key>
							<string>15.99</string>
							<key>minosversion</key>
							<string>10.13</string>
							<key>path</key>
							<string>/Applications/Microsoft Outlook.app</string>
							<key>type</key>
							<string>application</string>
							<key>version_comparison_key</key>
							<string>CFBundleShortVersionString</string>
						</dict>
						<dict>
							<key>CFBundleIdentifier</key>
							<string>com.microsoft.Powerpoint</string>
							<key>CFBundleName</key>
							<string>PowerPoint</string>
							<key>CFBundleShortVersionString</key>
							<string>15.99</string>
							<key>CFBundleVersion</key>
							<string>15.99</string>
							<key>minosversion</key>
							<string>10.13</string>
							<key>path</key>
							<string>/Applications/Microsoft PowerPoint.app</string>
							<key>type</key>
							<string>application</string>
							<key>version_comparison_key</key>
							<string>CFBundleShortVersionString</string>
						</dict>
						<dict>
							<key>CFBundleIdentifier</key>
							<string>com.microsoft.Word</string>
							<key>CFBundleName</key>
							<string>Word</string>
							<key>CFBundleShortVersionString</key>
							<string>15.99</string>
							<key>CFBundleVersion</key>
							<string>15.99</string>
							<key>minosversion</key>
							<string>10.13</string>
							<key>path</key>
							<string>/Applications/Microsoft Word.app</string>
							<key>type</key>
							<string>application</string>
							<key>version_comparison_key</key>
							<string>CFBundleShortVersionString</string>
						</dict>
					</array>
				</dict>
			</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
