<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Mendeley Reference Manager and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.peetinc.munki.MendeleyReferenceManager</string>
	<key>Input</key>
	<dict>
		<key>DISPLAY_NAME</key>
		<string>Mendeley Reference Manager</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>MendeleyReferenceManager</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Mendeley Reference Manager simplifies your workflow, so you can focus on achieving your goals. It has been built using researchers’ feedback to give you what you need to manage your references even more quickly and effectively.</string>
			<key>developer</key>
			<string>Elsevier Inc.</string>
			<key>display_name</key>
			<string>%DISPLAY_NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.peetinc.download.MendeleyReferenceManager</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
