<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Microsoft Teams and imports into munki.</string>
    
    <key>Identifier</key>
    <string>com.github.peetinc.munki.MicrosoftOffice365BusinessProSuite</string>
    
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MicrosoftOffice365BusinessProSuite</string>
        <key>DISPLAY_NAME</key>
        <string>Microsoft Office Pro</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Microsoft/O365</string>
        <key>CATEGORY</key>
		<string>Productivity</string>
		<key>MINIMUM_OS_VERSION</key>
		<string>10.13.6</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Unmistakably Office, designed for Mac. Do your best work—anywhere, anytime and with anyone. (Includes Microsoft Teams)</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>category</key>
			<string>%CATEGORY%</string>
			<key>developer</key>
			<string>Micrsoft</string>
			<key>minimum_os_version</key>
			<string>%MINIMUM_OS_VERSION%</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.download.MicrosoftOffice365BusinessProSuite</string>
    <key>Process</key>
        <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>