<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Imports Kerio Control VPN Client </string>

        <key>Identifier</key>
        <string>com.github.peetinc.munki.KerioControlVPNClient</string>

        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>KerioControlVPNClient</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/Kerio</string>
            <key>DEVELOPER</key>
            <string>Kerio (GFI)</string>ß
            <key>CATEGORY</key>
            <string>Security</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>description</key>
                <string>Kerio Control VPN is needed for connecting to Kerio Control via ssl VPN.</string>
                <key>display_name</key>
                <string>Kerio Control VPN Client</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>developer</key>
                <string>%DEVELOPER%</string>
                <key>category</key>
                <string>%CATEGORY%</string>
                <key>unattended_install</key>
                <false/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.peetinc.download.KerioControlVPNClient</string>
        <key>Process</key>
        <array>
           
        </array>
    </dict>
</plist>
