<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Comment</key>
    <string>The two url's are:
    	https://cdn.kerio.com/dwn/kerio-control-vpnclient-mac.dmg
    	https://cdn.kerio.com/dwn/kerio-control-vpnclient-mac-apple-silicon.dmg
    	</string>
    
    <key>Description</key>
    <string>Downloads Kerio Control VPN Client</string>
    
    <key>Identifier</key>
    <string>com.github.peetinc.download.KerioControlVPNClient</string>
    
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>KerioControlVPNClient-INTEL</string>
        <key>DOWNLOAD_URL</key>
        <string>https://cdn.kerio.com/dwn/kerio-control-vpnclient-mac.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
    	<dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                             <string>%DOWNLOAD_URL%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Kerio Control VPN Client Installer.pkg</string>
                <key>expected_authority_names</key>
        			<array>
            			<string>Developer ID Installer: GFI Software Development Ltd (ESPPW8V28N)</string>
            			<string>Developer ID Certification Authority</string>
            			<string>Apple Root CA</string>
        			</array>
        	</dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
    	</dict>
    	<dict>
    		 <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%/Kerio Control VPN Client Installer.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/expand</string>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
        </dict>
        <dict>
    		 <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/expand/Kerio_Conntrol_VPN_Client.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/root</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
		    <key>Arguments</key>
		    <dict>
		        <key>input_plist_path</key>
		        <string>%RECIPE_CACHE_DIR%/root/usr/local/kerio/vpnclient/KVpnClientAgent.app/Contents/Info.plist</string>
		    </dict>
            <key>Processor</key>
		    <string>Versioner</string>
		</dict>
    </array>
</dict>
</plist>