<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
    <string>The two supported_architectures: x86_64 and arm64</string>
	
	<key>Description</key>
	<string>Imports Kerio Control VPN Client.</string>
	<key>Identifier</key>
	<string>com.github.peetinc.munki.KerioControlVPNClient</string>
	<key>Input</key>
	<dict>
		<key>ARCH</key>
		<string>x86_64</string>
		<key>CATEGORY</key>
		<string>Security</string>
		<key>DEVELOPER</key>
		<string>Kerio (GFI)</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Kerio</string>
		<key>NAME</key>
		<string>KerioControlVPNClient</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%CATEGORY%</string>
			<key>description</key>
			<string>Kerio Control VPN is needed for connecting to Kerio Control via ssl VPN.</string>
			<key>developer</key>
			<string>%DEVELOPER%</string>
			<key>display_name</key>
			<string>Kerio Control VPN Client</string>
			<key>minimum_os_version</key>
			<string>10.8.0</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>supported_architectures</key>
			<array>
				<string>%ARCH%</string>
			</array>
			<key>blocking_applications</key>
			<array/>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.peetinc.download.KerioControlVPNClient</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/root</string>
				<key>installs_item_paths</key>
				<array>
					<string>/usr/local/kerio/vpnclient/KVpnClientAgent.app</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/root</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>