<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Azul Zulu OpenJDK or JRE 7, 8, 11, 17 LTS or STS.
	Set the NAME key from "AzulZuluOpenJRE8LTS" to the best name for you based on your variables.
	Set the ARCHITECTURE key to "x" to download the Intel version or "aarch" for Apple Silicon version.
	Set the JVM key to "jre" or "jdk" (note: !!"jre" only works with "aarch"!! ...jre is "Java Runtime Environment". jdk is "Java Development Kit".)
	Set the RELEASE key to "7" (Note: LTS, Intel-Only), "8" (Note: LTS), "11" (Note: LTS), "13" (Note: MTS), "15" (Note: MTS), "17" (Note: LTS), "18" (Note: STS) or "19" (Note: STS)
	Set the SUPPORT key to "LTS", "MTS", or "STS" (Note only used for munki display_name and name)
	</string>
    <key>Identifier</key>
    <string>com.github.peetinc.download.AzulZulu</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AzulZuluOpenJRE8LTS</string>
        <key>ARCHITECTURE</key>
        <string>aarch</string>
        <key>JVM</key>
        <string>jdk</string>
        <key>RELEASE</key>
        <string>8</string>
        <key>SUPPORT</key>
        <string>LTS</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>\"(zulu%RELEASE%.*?-ca-%JVM%%RELEASE%.*?-macosx_%ARCHITECTURE%64\.dmg)\"</string>
                <key>url</key>
                <string>https://cdn.azul.com/zulu/bin/?C=M;O=D</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://cdn.azul.com/zulu/bin/%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Azul Systems, Inc. (TDTHCUPYFR)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
                <key>input_path</key>
                <string>%pathname%/Double-Click to Install Azul Zulu %JVM% %RELEASE%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>