<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Azul Zulu OpenJDK or JRE 7, 8, 11, 17 LTS or STS.
	Set the NAME key from "AzulZuluOpenJRE8LTS" to the best name for you based on your variables.
	Set the ARCHITECTURE key to "x" to download the Intel version or "aarch" for Apple Silicon version.
	Set the JVM key to "jre" or "jdk" (note: jre is "Java Runtime Environment". jdk is "Java Development Kit".)
	Set the RELEASE key to "7" (Note: LTS, Intel-Only), "8" (Note: LTS), "11" (Note: LTS), "13" (Note: MTS), "15" (Note: MTS), "17" (Note: LTS), "18" (Note: STS) or "19" (Note: STS)
	</string>
    <key>Identifier</key>
    <string>com.github.peetinc.pkg.AzulZulu</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AzulZuluOpenJRE8LTS</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.3</string>
    <key>ParentRecipe</key>
    <string>com.github.peetinc.download.AzulZulu</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.homebysix.VersionSplitter/VersionSplitter</string>
            <key>Arguments</key>
            <dict>
                <key>version</key>
                <string>%match%</string>
                <key>index</key>
                <integer>0</integer>
                <key>split_on</key>
                <string>.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%version%.pkg</string>
                <key>source_pkg</key>
                <string>%pathname%/Double-Click to Install Azul Zulu %JVM% %RELEASE%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>