<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Microsoft MicrosoftOneDrive MIN_OS_VER 10.12</string>
    <key>Description</key>
    <string>Downloads the latest version of Microsoft MicrosoftOneDrive imports into munki.</string>
    <key>Identifier</key>
    <string>com.github.peetinc.munki.MicrosoftOneDrive</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MicrosoftOneDrive</string>
        <key>DISPLAY_NAME</key>
        <string>Microsoft OneDrive</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Microsoft/OneDrive</string>
        <key>CATEGORY</key>
		<string>Productivity</string>
		<key>MIN_OS</key>
		<string>10.12.0</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Get to your files from anywhere, on any device, with Microsoft OneDrive. Share and work together with anyone in your work and life. With OneDrive for Business, you also get storage for your work files so you can share and collaborate on them with other people at your work or school/university. The OneDrive app for Mac makes it easy to work with your OneDrive files on your Mac.</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>category</key>
			<string>%CATEGORY%</string>
			<key>minimum_os_version</key>
			<string>%MIN_OS%</string>
			<key>developer</key>
			<string>Microsoft</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.peetinc.download.MicrosoftOneDrive</string>
    <key>Process</key>
        <array>
			<dict>
	        <key>Arguments</key>
	        <dict>
	        	<key>purge_destination</key>
				<true/>
	            <key>flat_pkg_path</key>
	            <string>%pathname%</string>
	            <key>destination_path</key>
	            <string>%RECIPE_CACHE_DIR%/tmp/PKGs</string>
	        </dict>
	    	<key>Processor</key>
	        <string>FlatPkgUnpacker</string>
			</dict>
			<dict>
	    	<key>Arguments</key>
  	    	  <dict>
					<key>purge_destination</key>
					<true/>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/tmp/PKGs/OneDrive.pkg/Payload</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/tmp/payload/Applications/</string>
  	    	   </dict>
  	    	   <key>Processor</key>
  	    	   <string>PkgPayloadUnpacker</string>
  	  		</dict>
			<dict>
  	  	<key>Arguments</key>
  	      	<dict>
  	          	<key>faux_root</key>
  	          	<string>%RECIPE_CACHE_DIR%/tmp/payload</string>
  	          	<key>installs_item_paths</key>
  	          	<array>
  	      			<string>/Applications/OneDrive.app</string>
  	          	</array>
  	      	</dict>
  	      <key>Processor</key>
  	      <string>MunkiInstallsItemsCreator</string>
  	  </dict>
  	  	<dict>
  	  	<key>Processor</key>
  	      <string>MunkiPkginfoMerger</string>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
