<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uses rtrouton parent download recipe to download the latest unlicensed Microsoft Office 2016 installer package.</string>
	<key>Identifier</key>
	<string>com.github.peetinc.munki.Office2016Suite</string>
	<key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MicrosoftOffice2016</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Microsoft/Office2016</string>
        <key>DISPLAY_NAME</key>
        <string>Microsoft Office 2016</string>
        <key>MUNKI_CATEGORY</key>
        <string>Productivity</string>
        <key>MINIMUM_OS</key>
        <string>10.10</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Unmistakably Office, designed for macOS.</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
			<key>developer</key>
			<string>Microsoft</string>
            <key>minimum_os_version</key>
			<string>%MINIMUM_OS%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
	<key>MinimumVersion</key>
	<string>0.4.1</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.download.MicrosoftOffice365Suite</string>
	<key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>