<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Macs Fan Control and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.peetinc.munki.rclone</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/rclone</string>
		<key>NAME</key>
		<string>rclone</string>
		<key>DEVELOPER</key>
		<string>Nick Craig-Wood</string>
		<key>CATAGORY</key>
		<string>Utilities</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Rclone, like rsync for cloud storage. Sync files to and from many cloud storage providers.</string>
			<key>developer</key>
			<string>%DEVELOPER%</string>
			<key>catagory</key>
			<string>%CATAGORY%</string>
			<key>display_name</key>
			<string>rclone</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.peetinc.pkg.rclone</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
