<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Macs Fan Control and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.peetinc.pkg.rclone</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>com.crystalidea.rclone</string>
		<key>NAME</key>
		<string>rclone</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.peetinc.download.rclone</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>usr</key>
					<string>0755</string>
					<key>usr/local</key>
					<string>0755</string>
					<key>usr/local/bin</key>
					<string>0755</string>
					<key>usr/local/share</key>
					<string>0755</string>
					<key>usr/local/share/man</key>
					<string>0755</string>
					<key>usr/local/share/man/man1</key>
					<string>0755</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkg_root</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		 <dict>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/rclone/rclone-*</string>
            </dict>
            <key>Processor</key>
            <string>FileFinder</string>
        </dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%found_filename%/rclone</string>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/pkg_root/usr/local/bin/rclone</string>
			</dict>
			<key>Processor</key>
			<string>FileMover</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%found_filename%/rclone.1</string>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/pkg_root/usr/local/share/man/man1/rclone.1</string>
			</dict>
			<key>Processor</key>
			<string>FileMover</string>
		</dict>
		<dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                	<key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/pkg_root</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>id</key>
                    <string>org.rclone.rclone</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>usr</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                            <key>mode</key>
                            <string>0755</string>
                        </dict>
                    </array>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PkgCreator</string>
        </dict>
	</array>
</dict>
</plist>
