<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Microsoft Remote Desktop MIN_OS_VER 10.12</string>
	<key>Description</key>
	<string>Downloads the latest version of Microsoft Remote Desktop and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.peetinc.munki.MicrosoftRemoteDesktop</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Microsoft/%NAME%</string>
		<key>NAME</key>
		<string>MicrosoftRemoteDesktop</string>
		<key>CATEGORY</key>
		<string>Remote Access</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Use the new Microsoft Remote Desktop app to connect to a remote PC or virtual apps and desktops made available by your administrator. The app helps you be productive no matter where you are.</string>
			<key>developer</key>
			<string>Microsoft</string>
			<key>display_name</key>
			<string>Microsoft Remote Desktop</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>category</key>
			<string>%CATEGORY%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.peetinc.download.MicrosoftRemoteDesktop</string>
	<key>Process</key>
	<array>
		<dict>
        <key>Arguments</key>
        <dict>
        	<key>purge_destination</key>
			<true/>
            <key>flat_pkg_path</key>
            <string>%pathname%</string>
            <key>destination_path</key>
            <string>%RECIPE_CACHE_DIR%/tmp/PKGs</string>
        </dict>
    	<key>Processor</key>
        <string>FlatPkgUnpacker</string>
    </dict>
	<dict>
	    <key>Arguments</key>
        <dict>
        	<key>purge_destination</key>
			<true/>
            <key>pkg_payload_path</key>
            <string>%RECIPE_CACHE_DIR%/tmp/PKGs/com.microsoft.rdc.macos.pkg/Payload</string>
            <key>destination_path</key>
            <string>%RECIPE_CACHE_DIR%/tmp/payload/Applications/</string>
         </dict>
         <key>Processor</key>
         <string>PkgPayloadUnpacker</string>
    </dict>
	<dict>
    	<key>Arguments</key>
        	<dict>
            	<key>faux_root</key>
            	<string>%RECIPE_CACHE_DIR%/tmp/payload</string>
            	<key>installs_item_paths</key>
            		<array>
                   		<string>/Applications/Microsoft Remote Desktop.app</string>
               		</array>
            </dict>
        <key>Processor</key>
        <string>MunkiInstallsItemsCreator</string>
    </dict>
    <dict>
    	<key>Processor</key>
        <string>MunkiPkginfoMerger</string>
    </dict>
	<dict>
	 <key>Arguments</key>
        <dict>
            <key>source</key>
            <string>%pathname%</string>
            <key>target</key>
            <string>%RECIPE_CACHE_DIR%/downloads/MicrosoftRemoteDesktop.pkg</string>
        </dict>
    	<key>Processor</key>
        <string>FileMover</string>
    </dict>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>pkg_path</key>
			<string>%RECIPE_CACHE_DIR%/downloads/MicrosoftRemoteDesktop.pkg</string>
			<key>repo_subdirectory</key>
			<string>%MUNKI_REPO_SUBDIR%</string>
		</dict>
		<key>Processor</key>
		<string>MunkiImporter</string>
	</dict>
	</array>
</dict>
</plist>
