<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Office 2016 MIN_OS_VER 10.10.0 - Office 2019 MIN_OS_VER 10.13.6</string>
	<key>Description</key>
	<string>Downloads the latest version of Microsoft Office Suite and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.peetinc.munki.MicrosoftRemoteDesktop</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Microsoft/%NAME%</string>
		<key>NAME</key>
		<string>MicrosoftRemoteDesktop</string>
		<key>CATEGORY</key>
		<string>Remote Access</string>
		<key>MIN_OS_VER</key>
		<string>10.12.0</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Use the new Microsoft Remote Desktop app to connect to a remote PC or virtual apps and desktops made available by your administrator. The app helps you be productive no matter where you are.</string>
			<key>developer</key>
			<string>Microsoft</string>
			<key>display_name</key>
			<string>Microsoft Remote Desktop</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>category</key>
			<string>%CATEGORY%</string>
			<key>minimum_os_version</key>
			<string>%MIN_OS_VER%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.peetinc.download.MicrosoftRemoteDesktop</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
