<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Synology Surveillance Station Client and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.peetinc.munki.SynologySurveillanceStationClient</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Surveillance_Station_Client</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>SynologySurveillanceStationClient</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Synology Surveillance Station Client Helper (Plugin).app</string>
				<string>Surveillance_Station_Client.app</string>
				<string>Monitor Center.app</string>
				<string>Synology Surveillance Station Client Helper (GPU).app</string>
				<string>Synology Surveillance Station Client Helper.app</string>
				<string>Recording.app</string>
				<string>Synology Surveillance Station Client Helper (Renderer).app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Synology</string>
			<key>description</key>
			<string>Protect your business or home with a reliable and intuitive surveillance solution with powerful and intelligent video monitoring, management, and analysis tools.</string>
			<key>developer</key>
			<string>Synology Inc.</string>
			<key>display_name</key>
			<string>Synology Surveillance Station Client</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.ahousseini-recipes.download.SynologySurveillanceStationClient</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
