<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Comment</key>
        <string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
        <key>Description</key>
        <string>Downloads the latest version of Splashtop for RMM and imports it into Munki.</string>
        <key>Identifier</key>
        <string>com.github.peetinc.munki.SplashtopforRMM</string>
        <key>Input</key>
        <dict>
            <key>CATEGORY</key>
            <string>Remote Access</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/%NAME%</string>
            <key>NAME</key>
            <string>SplashtopforRMM</string>
            <key>pkginfo</key>
            <dict>
                <key>blocking_applications</key>
                <array>
                    <string>Splashtop for RMM.app</string>
                    <string>printPreivew.app</string>
                </array>
                <key>category</key>
                <string>%CATEGORY%</string>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>description</key>
                <string>Delivers remote access, remote support, cross-screen productivity and collaboration experience.</string>
                <key>developer</key>
                <string>Splashtop</string>
                <key>display_name</key>
                <string>Splashtop for RMM</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.peetinc.download.SplashtopforRMM</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>